iedmacs.org
#+title: GNU IEDmacs configuration
#+author: AreTaro
#+language: fr
#+options: ':t toc:nil num:t author:t
#+startup: content indent
#+macro: latest-export-date (eval (format-time-string "%F %T %z"))
#+macro: word-count (eval (count-words (point-min) (point-max)))


#+begin_src emacs-lisp
 __   _______  _______  .___  ___.      ___       ______     _______.
|  | |   ____||       \ |   \/   |     /   \     /      |   /       |
|  | |  |__   |  .--.  ||  \  /  |    /  ^  \   |  ,----'  |   (----`
|  | |   __|  |  |  |  ||  |\/|  |   /  /_\  \  |  |        \   \    
|  | |  |____ |  '--'  ||  |  |  |  /  _____  \ |  `----.----)   |   
|__| |_______||_______/ |__|  |__| /__/     \__\ \______|_______/    
                                                                     
#+end_src

Ceci est une Version aménagée d'Emacs pour les étudiants de l'IED8 Paris
qui le souhaitent, nommée pour l'occasion IEDmacs.

Emacs n'est peut-être pas toujours facile à prendre
en main, et certainement pas le meilleur IDE puisqu'il est loin de faire
l'unanimité, mais j'ai personnellement essayé de l'abandonner
plusieurs fois, mais à chaque fois j'y suis revenu, alors j'ai pensé
que je devais faire quelque chose pour celles et ceux qui voudrait s'y
essayer.

Ce document est une tentative d'explication du code du fichier
"init.el" qui permet de personnaliser Emacs. L'objectif est d'avoir un
version d'Emacs plus facile à prendre en main afin de rendre avec un
peu moins de difficultés les premiers devoirs (mais ça marchera aussi
pour les suivants). Ce document reprend le concept de "[[https://fr.wikipedia.org/wiki/Programmation_lettr%C3%A9e][Progammation
lettrée]]" ("Literate Programming" en anglais) qui consiste à intégrer
les explications directement au sein du code.

Emacs et Orgmode permettent de générer un fichier de code à partir
d'un fichier ~.org~ en ne conservant que les parties de code indiquées
entre des balises dans le fichier. Ainsi, le fichier "init.el"
disponible dans le dépôt est généré automatiquement à partir de ce fichier
en utilisant le raccourci ~Ctrl-c Ctrl-v Ctrl-t~.

Ce fichier est composé de plusieurs parties comme suit:
- Définitions: Lexique de certains mots ou acronymes utilisés.
- Documentation Utilisateur: Information pour l'installation et
  l'utilisation.
- Documentation Système: Description et explication du fichier
  "init.el"
- Recommandations: Informations et bonnes pratiques pour la rédaction
  et le maintient de ce dépôt.
  
* Définitions
** Buffer

Pour dire simplement, dans Emacs, un buffer est une fenêtre. Il peut y
avoir plusieurs buffers d'ouvert, et il est possible de passer de l'un
à l'autre ou d'en afficher plusieurs à la fois.

** Elpa

Elpa est le dépôt par défault des paquets pour GNU emacs. Il en existe
d'autres comme par exemple MELPA ou GNU.

** Integrate Development Environment (IDE)
C'est un environnement de développement logiciel qui regroupe divers
outils pour faciliter l'écriture, la compilation, le débogage et le
déploiement de programmes informatiques.
** Orgmode

Orgmode est un "mode" (mis entre guillemet car je ne sais pas encore
bien définir ce qu'est un mode) ou un paquet permettant l'édition de
documents à partir de texte brut.

* Documentation Utilisateur
** Guide d'installation
Installation et configuration d'IEDmacs.
1. Installer Emacs
    ~sudo apt-get install emacs~
2. Installer LaTex
    ~sudo apt-get install texlive-full~
3. Télécharger les fichiers de l'IEDmacs
   #+begin_src shell
   for file in init.el ied-latex-standard.org iedmacs.org; do curl -o ~/.emacs.d/$file https://raw.githubusercontent.com/AreTaro/iedmacs/main/$file; done
   #+end_src

   Il y a quatres fichiers:
   - *init.el:* c'est le fichier lu à l'ouverture par emacs avec
     quelques packages utiles préinstallés.
   - *ied-latex-standard.org:* c'est le fichier qui permet la
     configuration pour convertir votre fichier en LaTex.
   - *iedmacs.org:* c'est le fichier qui fait office de manuel et qui
     permet de générer le fichier "init.el" de l'IEDmacs.
     
   Ceci est juste une version simplifiée d'Emacs avec quelques
   packages utiles préinstallés. Pour plus de détails, voir le
   chapitre "Documentation Système". Libre à vous de choisir un autre
   répertoire pour les fichiers mais il faudra modifier leur chemin
   d'accès dans le fichier "init".
** Guide du débutant / Tutoriel
Explications simples pour commencer à utiliser IDEmacs et exemples
concrets d'utilisation.
*** Lancer IEDmacs
Pour lancer IEDmacs utiliser la commande ~emacs &~, ou faites le
directement en cliquant sur l'icône emacs qui se sera créé après
l'installation.
*** Les Commandes de base
Il est généralement recommandé de commencer par le tutoriel
d'utilisation d'Emacs (~Ctrl-h t~) pour apprendre les nombreux
raccourcis. Mais certaines commandes seront peut-être nécessaire pour
tester et essayer rapidement IDEmacs, d'autant plus que vous serez
peut-être déjà en retard dans le rendu de vos devoirs et qu'il est
possible que vous remettiez le tutoriel à plus tard. Dans ce cas voici
quelques commandes essentiels:
- ~Ctrl-f~, ~Ctrl-b~, ~Ctrl~p~, ~Ctrl~n~: pour avancer, reculer,
    monter, descendre le curseur respectivement.
- ~Ctrl-g~ pour sortir d'un menu ou d'une commande. Souvent utile car
  dans emacs, la touche "Esc" ne permet pas toujours de s'échapper
  d'un menu.
- ~Ctrl-x Ctrl-c~ pour quitter
- ~Ctrl-x f~ pour ouvrir un fichier
- ~Ctrl-x b~ pour basculer d'une fichier ouvert (buffer) à l'autre.
Pour la liste complète, aller voir sur la [[https://www.gnu.org/software/emacs/refcards/pdf/refcard.pdf][carte de référence]].
*** Rédiger un devoir
1. Ouvrir un fichier pour le devoir
   Il y a au moins deux méthodes. La première consiste à ouvrir un
   fichier vierge et à y insérer le code nécessaire pour l'export
   LaTex en PDF. La seconde consiste à télécharger un fichier
   échantillon à le code déjà ajouté.

   *Méthode 1*

   - Utiliser la commande ~Ctrl-x Ctrl-f~ comme pour ouvrir un fichier,

   - Sélectionner le dossier où enregistrer le fichier,

   - Nommer le fichier et presser entrer. Cela ouvrira un nouveau buffer ou fichier vierge,

   - Copier le code ci-dessous, en remplaçant les informations par
     les vôtres.

    #+BEGIN_SRC  
       #+TITLE: [NOM DU CHAPITRE]
       #+SUBTITLE: [NOM DU COURS]
       #+OPTIONS: toc:t author:nil
       #+LaTeX_HEADER: \author{[PRENOM NOM] \\ N. Etudiant : [NUMERO]}
       #+SETUPFILE: ~/.emacs.d/ied-latex-standard.org

       \newpage

        * Exercice X
        ** Enoncé
        :PROPERTIES:
        :UNNUMBERED: t
        :END:

        ** Réponse
        :PROPERTIES:
        :UNNUMBERED: t
        :END:
   #+END_SRC

      *Méthode 2*
      Sur la page d'accueil de l'IEDmacs, sélectionner le lien
     "Rédiger un devoir dans l'IEDmacs". Cela ouvrira un nouveau
     buffer avec le code ci-dessus et quelques
     instructions. Enregistrer le fichier dans le répertoire et sous
     le nom de votre choix en utilisant la commande ~Ctrl-x Ctrl-s~.

2. Rédiger votre dévoir
   Utiliser la synthaxe orgmode pour écrire votre texte. Pour plus de
   détails sur la syntax voir le dépôt en anglais [[https://github.com/fniessen/refcard-org-mode][refcard-org-mode]].

   Vous pouvez également utiliser la synthaxe LaTex au sein de votre
   fichier ".org" en utilisant le raccourci ~Ctrl-c Ctrl-, l~ (Clavier
   azerty). Pour plus d'information sur la synthaxe LaTex voir le
   dépôt de [[https://github.com/amartos/TexIEDP8][amartos]].

3. Editer votre devoir au format PDF
   Une fois votre devoir ou document rédiger, il suffit d'utiliser le
   raccourci ~Ctrl-c Ctrl-e l p~, et votre fichier LaTex ainsi que le
   document PDF seront crée automatiquement.
  
** Guide de référence
Description détaillée de chaque fonctionnalité du système,
utilisation avancée et cas d'usage spécifiques.
*** Explication de la barre de commande

La bar de commande est décrite dans le fichier /init.el/ avec
~mode-line~. Pour plus de détail voir la section correspondante dans
la documentation système.

La signification de chacune des
indications est décrite ci-dessous en partant de la gauche :
- La première lettre indique le mode d'édition "E" pour /emacs/, "V"
  pour /vim/ et "I" pour le mode d'insertion de Vim.
- Les deux lettres suivantes correspondent au mode d'écriture
  (~input-mode~) avec "FR" pour le clavier français et "EN" pour le
  clavier anglais. C'est le clavier anglais qui est ouvert par
  défaut. Le clavier français est nécessaire pour écrire avec les
  accents mais vraiment tout pourri lorsqu'il faut écrire des chiffres
  ou des symboles. Désolé pour cela.
- Ensuite la date et l'heure sont affichés. Il est possible d'ajouter
  une seconde horloge en recopiant la partie de code correspondante et
  en ajoutant la zone comme suit ~"%H:%M " (current-time)
  "Europe/Berlin"~
- Le nom du buffer ouvert qui correspond aussi au nom du
  fichier ouvert est indiqué en caractère gras coloré.
- Et enfin les deux derniers chiffres séparer par ":" représente à
  gauche le numéro de ligne et à droite la colonne ou position du
  curseur sur la ligne.

*** Lire un document PDF

C'est le paquet ~pdf-tool~ qui est utilisé. Ce paquet permet de
visualiser et annoter un document PDF directement dans l'IEDmacs. Il
est aussi très utile lors de l'export de devoir, car la commande ~C-v
C-e l o~ permet d'ouvrir le document directement dans l'IEDmacs après
son export, et ainsi de vérifier ou non sa conformité avec ses
attentes.

- ~+~ ou ~-~ pour le zoom avant et arrière
- ~H~ pour ajuster en hauteur
- ~W~ pour ajuster en largeur
- ~P~ pour ajuter à la page
- ~n~ page suivante
- ~p~ page précédente
- ~Ctrl-n~ pour descendre dans la page
- ~Ctrl-p~ pour monter dans la page
- ~o~ pour afficher la table de matière
- ~Alt-g g~ pour sauter à une page indiquée

Pour plus d'informations pour l'instant consulté le dépôt Github du
paquet en anglais : [[https://github.com/vedang/pdf-tools/tree/30b50544e55b8dbf683c2d932d5c33ac73323a16?tab=readme-ov-file#view-and-navigate-pdfs][git repository]].
  
*** Les Thèmes
Il existe beaucoup de thèmes et chacun choisit ou modifie généralement
le sien selon ses préférences. Pour l'IEDmacs c'est le thème crée par
"Prot" (voir "Les Oracles"). Il a été choisi pour son confort de
lecture, aussi bien en mode sombre et clair.

Voici quelques commandes utile pour le thème:
- ~Alt-x load-theme~ pour choisir un autre thème
- ~Alt-x modus-theme-select~ pour choisir un autre thème parmis le
  thème "modus" de Prot.
- ~Alt-x my-modus-themes-select~ pour passer du mode sombre au mode
  clair.

Pour plus de faciliter vous pouver créer des raccourcis vers ces
fonctions.

*** Faire une recherche

Pour faire une recherche, c'est le paquet "swiper" est utilisé :
- Utiliser la commande ~Ctrl-s~ ouvrir Swiper. Une fenêtre apparaîtra
  dans la barre de commande.
- Taper le mot recherché, puis naviguer dans la liste de choix avec
  la ~Ctrl-n~ pour descendre et ~Ctrl-p~ pour monter.
- Une prévisualisation de la recherche et de l'emplacement concerné
  sera visible dans le buffer.
- Appuyer sur Entrée pour selectionner. Cela fermera la fenêtre et
  déplacera le curseur à l'endroit choisi.

*** LLM

Le paquet ~gptel~ fournit un moyen d'envoyer des prompts directement à
partir d'un buffer dans Emacs. Pour activer GPTel, vous pouvez ajouter
le bloc de code correspondant à votre fichier ~init.el~.

Pour plus de détails sur le bloc à ajouter, reportez-vous à la section
"GPTel" dans le manuel d'utilisation.

**Activation de GPTel**

Après l'installation du paquet, vous pouvez lancer GPTel en entrant
~M-x gptel~.

**Envoi de Prompts**

Pour envoyer un prompt, utiliser ~M-x RET~ ou la commande ~M-x
gptel-send~.

**Accès au Menu GPTel**

Le menu GPTel vous permet de modifier divers paramètres. Pour accéder,
utiliser la commande ~M-x gptel-menu~

Notez que toutes les commandes mentionnées ci-dessus doivent être
saisies dans la minibuffer d'Emacs.

Pour plus d'informations sur l'utilisation de GPTel, consulter la
documentation complète du paquet. ([[eww:https://github.com/karthink/gptel][GitHub]])

*** eww - Emacs Web Wowser

~Ctrl-c Ctrl-o~ ouvrir un lien

** Notes de version
   Informations sur les changements importants.
*** nom des versions
Voici les noms suggérés pour les prochaines versions. Il y a de quoi
voir venir, et encore de longues années devant pour l'IEDmacs.

1. Apollon Funky
2. Héra Cyber
3. Izanagi Groovy
4. Sarasvati Electro
5. Kuan Yin Techno
6. Dionysos Chic
7. Amaterasu Hyper
8. Vishnu Digital
9. Héphaïstos Psy
10. Benten Electro
11. Ares Techno
12. Inari Gigabyte
13. Parvati Turbo
14. Tsukuyomi Synthwave
15. Krishna Pixel
16. Athena Futuriste
17. Izanami Electro
18. Shiva Néon
19. Hestia Techno
20. Benzaiten Globo

**Apollon Funky**
- *0.0.0* Première version Apollon Funky, Novembre 2024
- *0.3.0*: which-key menu rendu visible
- *0.4.0*: pdf-tools, barre de commande modifiée

**Hera Cyber**
- *1.0.0*: optimisation du démarrage, gptel, Fichier récent (prev. fin
  déc. 2024)
   
** Carte de référence rapide
   Aide-mémoire des commandes et raccourcis clavier les plus utilisés.
** Gestion des paquets et extensions
* Documentation Système
** Principes du Système
Objectifs et philosophie de conceptions d'IDEmacs.
** Spécification / Conception
Lors de son démarrage, Emacs recherche d'abord un fichier nommé
"init.el" contenant du code Lisp qu'il exécute. Le fichier "init.el"
de l'IEDmacs est automatiquement généré par des blocs de code
spécifiques. Tout bloc de code commençant par une directive ~:tangle
"init.el"~ sera inclus dans le fichier "init.el" généré en utilisant la
commande ~Ctrl-c Ctrl-v Ctrl-t~.

Pour personnaliser votre configuration dans l'IEDmacs, vous pouvez
ajouter ou supprimer des blocs de code selon vos besoins. Vous pouvez
également activer ou désactiver des commandes en supprimant ou en
ajoutant les symboles ~;;~ devant la ou les commandes souhaitées.

*** Entête du fichier
Par convention les informations sur la version sont indiqués au début
du fichier "init.el". Ainsi lorsque plusieurs version sont utilisées,
il est possible de rapidement indentifier la version actuelle du
fichier "init.el" en utilisant la commande ~head 10
~/.emacs.d/init.el~.

#+begin_src emacs-lisp :tangle "init.el"
  ;; IDEmacs by Emacs, un IDE pour l'IED.
  ;; VERSION : Apollon Funky 0.4.0
  ;; LICENCE : GPLV3
#+end_src

*** Fenêtre d'accueil
Cette section concerne tout ce qui touche à l'aspect d'IEDmacs à
l'ouverture mais aussi tout au long de son utilisation.

   #+begin_src emacs-lisp :tangle "init.el"
     ;; Supprimer le message de démarrage
     (setq inhibit-startup-message t)

     ;; Supprimer le bar de menu
     (menu-bar-mode -1)

     ;; Supprimer la bar d'icon
     (tool-bar-mode -1)

     ;; Lancer le buffer de démarrage
     (add-hook 'emacs-startup-hook 'iedmacs-startup-buffer)

     ;; Supprimer le clignotement du curseur
     (blink-cursor-mode -1)

     ;; Supprimer la barre de défilement
     ;; Elle n'est ni bien pratique ni bien jolie
     (scroll-bar-mode -1)
#+end_src

*** Buffers personnalisés
