init.el
;; IDEmacs by Emacs, un IDE pour l'IED.
;; VERSION : Apollon Funky 0.4.0
;; LICENCE : GPLV3

;; Supprimer le message de démarrage
(setq inhibit-startup-message t)

;; Supprimer le bar de menu
(menu-bar-mode -1)

;; Supprimer la bar d'icon
(tool-bar-mode -1)

;; Lancer le buffer de démarrage
(add-hook 'emacs-startup-hook 'iedmacs-startup-buffer)
