iedmacs.org
**** Startup Buffer

#+begin_src emacs-lisp :tangle "init.el"
  (defun iedmacs-startup-buffer ()
    "Créez un buffer de démarrage pour IEDmacs avec un logo, une explication et des liens utiles."
    (let ((buffer (get-buffer-create "*IEDmacs*")))
      (with-current-buffer buffer
        (erase-buffer)

        (let* ((ascii-title '(
                              "  __   _______  _______  .___  ___.      ___       ______     _______. "
                              " |  | |   ____||       \\ |   \\/   |     /   \\     /      |   /       | "
                              " |  | |  |__   |  .--.  ||  \\  /  |    /  ^  \\   |  ,----'  |   (----` "
                              " |  | |   __|  |  |  |  ||  |\\/|  |   /  /_\\  \\  |  |        \\   \\     "
                              " |  | |  |____ |  '--'  ||  |  |  |  /  _____  \\ |  `----.----)   |    "
                              " |__| |_______||_______/ |__|  |__| /__/     \\__\\ \\______|_______/     "
                              ))
               (subtitle "Un IDE pour l'IED")
               (width (window-body-width))
               (padding-title (max 0 (/ (- width (length (car ascii-title))) 2)))
               (padding-subtitle (max 0 (/ (- width (length subtitle)) 2))))

          ;; Insérez un titre ASCII avec des marges.
          (dolist (line ascii-title)
            (insert (make-string padding-title ?\s)) ; add padding spaces
            (insert line "\n"))

          ;; Insérer un sous-titre avec des marges
          (insert "\n" (make-string padding-subtitle ?\s) subtitle "\n\n"))

        ;; Paragraphe - Raccourcis utiles
        (insert "Les commandes de bases:\n\n")

        ;; List des raccourcis
        (insert (propertize "Ctrl-f" 'face 'bold) ": avancer le curseur\n")
        (insert (propertize "Ctrl-b" 'face 'bold) ": reculer le curseur\n")
        (insert (propertize "Ctrl-p" 'face 'bold) ": monter le curseur\n")
        (insert (propertize "Ctrl-n" 'face 'bold) ": descendre le curseur\n")
        (insert (propertize "Ctrl-g" 'face 'bold) ": sors moi de cette m****!\n")
        (insert (propertize "Ctrl-x Ctrl-f" 'face 'bold) ": pour ouvrir ou créer un fichier\n")
        (insert (propertize "Ctrl-x b" 'face 'bold) ": pour basculer d'une fichier ouvert (buffer) à l'autre.\n")
        (insert (propertize "Ctrl-x Ctrl-c" 'face 'bold) ": pour quitter\n\n")

        ;; paragraphe
        (insert "Pour celles et ceux qui sont familiers avec les commandes VIM, activer les avec la commande : ")
        (insert (propertize "\"Alt-x evil-mode\"" 'face 'bold) ". Ensuite pour passer d'un mode de saisi à l'autre utiliser la commande ")
        (insert (propertize "Ctrl-z" 'face 'bold) ".\n\n")

        ;; Liens
        (insert "Liens utiles:\n")
        (insert-text-button "Rédiger un devoir avec l'IEDmacs"
                          'action (lambda (_) (modele-devoir-ied-buffer))
                          'follow-link t)
        (insert "\n")
        (insert-text-button "Le Wiki Paris 8 IED"
                            'action (lambda (_) (wiki-ied-buffer))
                            'follow-link t)
                            ;;'action (lambda (_) (browse-url "https://wiki.paris8-ied.net/"))
                            ;;'follow-link t)
        (insert "\n")
        (insert-text-button "Carte de références des raccourcis en français"
                            'action (lambda (_) (browse-url "https://www.gnu.org/software/emacs/refcards/pdf/refcard.pdf"))
                            'follow-link t)
        (insert "\n")
        (insert-text-button "Tutorial Emacs en français (ENS)"
                            'action (lambda (_) (eww "https://tuteurs.ens.fr/unix/editeurs/emacs.html"))
                            'follow-link t)
        (insert "\n\n")

        ;; Mot de la fin
        (insert "Pour plus d'information sur l'utilisation et la configuration de l'IEDmacs, vous pouvez vous référer au fichier: ")
        (insert-text-button "iedmacs.org\n"
                    'action (lambda (_) (find-file "~/.emacs.d/iedmacs.org"))
                    'follow-link t) 

        ;; Configurer le buffer en mode read-only
        (setq buffer-read-only t))
      ;; Afficher le buffer 
      (switch-to-buffer buffer)))
#+end_src

Quelque chose de plutôt sympa qu'il est possible de rajouter à la page
d'accueil, c'est la liste des derniers fichiers ouverts à
l'ouverture. Ceci permet de retrouver rapidement les fichiers sur
lequel on travaillait.

Pour ce faire il suffit d'insérer le code suivant à peu près où vous
voulez, mais à titre d'exemple, disons juste avant la ligne
";;Configurer le buffer en mode read-only" dans le bloc ci-dessus.

#+begin_src 
;; Section des fichiers récents avec des liens cliquables
(insert "\n" (propertize "Fichiers récents" 'face 'bold) "\n\n")
(require 'recentf)
(recentf-mode 1)
(let ((recent-files (cl-subseq recentf-list 0 (min 5 (length recentf-list))))) ;; 5 derniers fichiers
    (dolist (file recent-files)
    ;; Création d'une fermeture (closure) pour capturer correctement 'file'
    (insert-button (file-name-nondirectory file) ;; Affiche le nom du fichier
                    'action `(lambda (_)
                                (find-file ,file)) ;; Capture la valeur avec ',file
                    'follow-link t
                    'help-echo (concat "Ouvrir : " file)) ;; Info-bulle
    ;; Afficher le chemin complet abrégé en gris clair
    (insert "    " (propertize (abbreviate-file-name file) 'face 'shadow) "\n")))
#+end_src

La fonction est aussi accessible en utilsant la commande ~Alt-x
recentf-open-files~.

**** Modèle de devoir

#+begin_src emacs-lisp :tangle "init.el"
  (defun modele-devoir-ied-buffer ()
  "Creation d'un nouveau buffer avec un modèle pour les devoirs."
  (let ((buffer (get-buffer-create "*Devoir*")))
    (with-current-buffer buffer
      (erase-buffer)
      (org-mode)  ;; Basculer en Orgmode
      ;; Insérer le contenu du modèle
      (insert "#+TITLE: [NOM DU CHAPITRE]\n")
      (insert "#+SUBTITLE: [NOM DU COURS]\n")
      (insert "#+OPTIONS: toc:t author:nil\n")
      (insert "#+LaTeX_HEADER: \\author{[PRENOM NOM] \\\\ N. Etudiant : [NUMERO]}\n")
      (insert "#+SETUPFILE: ~/.emacs.d/ied-latex-standard.org\n\n")
      (insert "\\newpage\n\n")
      (insert "* Exercice X\n")
      (insert "** Enoncé\n")
      (insert " :PROPERTIES:\n")
      (insert " :UNNUMBERED: t\n")
      (insert " :END:\n\n")
      (insert "** Réponse\n")
      (insert " :PROPERTIES:\n")
      (insert " :UNNUMBERED: t\n")
      (insert " :END:\n\n")
      (insert " Instructions:\n")
      (insert " 1. Remplacer les blocks indiqués par [] par vos informations\n")
      (insert " 2. Rédiger votre devoir en utilisant la synthaxe Orgmode\n")
      (insert " 3. Enregister votre devoir avec la commande " (propertize "Ctrl-x Ctrl-s" 'face 'bold)".\n")
      (insert " 4. Une fois terminé, utilisez la commande " (propertize "Ctrl-c Ctrl-e l p" 'face 'bold)" pour convertir\n")
      (insert "    votre fichier en LaTex puis pour créer le pdf correspondant.\n")
      ;; Basculer vers le nouveau modèle
      (switch-to-buffer buffer))))
#+end_src

