iedmacs.org
**** Wiki IED 8
Le wiki est ouvert avec eww, et cela ne permet pas d'afficher les
différents menus qui sont sur le côté gauche de la page html. Ainsi un
buffer est crééer afin de reprendre les liens vers les principaux
chapitres.

#+begin_src emacs-lisp :tangle "init.el"
  (defun wiki-ied-buffer ()
  "Creation d'un nouveau buffer qui affiche les liens vers les chapitres du Wiki"
  (let ((buffer (get-buffer-create "*WikiIED8*")))
    (with-current-buffer buffer
      (erase-buffer)
      ;; Insérer le contenu du modèle
      (insert (propertize "Sommaire du Wiki\n\n" 'face 'bold))
      (insert "Cliquer sur le lien pour ouvrir la page dans eww (Emacs Web Browser)\n\n")

      ;; Paragraphe - Raccourcis utiles eww
      (insert "Les commandes utiles pour naviguer avec eww:\n\n")

      ;; List des raccourcis
      (insert (propertize "r" 'face 'bold) ": page eww précédente\n")
      (insert (propertize "l" 'face 'bold) ": page eww suivante \n")
      (insert (propertize "H" 'face 'bold) ": historique des pages eww\n\n")

      ;; Paragraphe - Raccourcis utiles emacs
      (insert "Petit rappel des commandes Emacs:\n\n")
      (insert (propertize "Ctrl-f" 'face 'bold) ": avancer le curseur\n")
      (insert (propertize "Ctrl-b" 'face 'bold) ": reculer le curseur\n")
      (insert (propertize "Ctrl-p" 'face 'bold) ": monter le curseur\n")
      (insert (propertize "Ctrl-n" 'face 'bold) ": descendre le curseur\n")
      (insert (propertize "Ctrl-g" 'face 'bold) ": sors moi de cette m****!\n")
      (insert (propertize "Ctrl-x b" 'face 'bold) ": pour basculer d'une fichier ouvert (buffer) à l'autre.\n\n")

      ;; Sommaire
      (insert (propertize "Général" 'face 'bold) "\n\n")
      (insert-text-button "Trucs cools"
                          'action (lambda (_) (eww "https://wiki.paris8-ied.net/fr/general/cool"))
                          'follow-link t)
      (insert "\n")
      (insert-text-button "Installation sur ce serveur Wiki"
                          'action (lambda (_) (eww "https://wiki.paris8-ied.net/fr/general/installation"))
                          'follow-link t)
      (insert "\n\n")
      (insert (propertize "Informations" 'face 'bold) "\n\n")
      (insert-text-button "Licence 1"
                          'action (lambda (_) (eww "https://wiki.paris8-ied.net/fr/L1"))
                          'follow-link t)
      (insert "\n")
      (insert-text-button "Licence 2"
                          'action (lambda (_) (eww "https://wiki.paris8-ied.net/fr/L2"))
                          'follow-link t)
      (insert "\n")
      (insert-text-button "Licence 3"
                          'action (lambda (_) (eww "https://wiki.paris8-ied.net/fr/L3"))
                          'follow-link t)


        ;; Configurer le buffer en mode read-only
        (setq buffer-read-only t))
    
      ;; Basculer vers le nouveau modèle
      (switch-to-buffer buffer)))
#+end_src

*** Barre de commande

Le bloc ci-dessous permet de controler l'apparance de la barre de
commande en bas de la fenêtre.

#+begin_src emacs-lisp :tangle "init.el"
  (display-time-mode 1)
  (setq display-time-day-and-date t)
  (setq column-number-mode t)
  (setq column-line-mode t)

  (setq-default mode-line-format
                (list
                 '(:eval (propertize
                          (if (and (boundp 'evil-state)
                                (eq evil-state 'normal) )
                            " V " ;; VIM
                            (if (and (boundp 'evil-state)
                                    (eq evil-state 'insert) )
                            " I " ;; Insert
                            " E ") ) ;; Emacs
                        'face 'cursor) )
                 '(:eval (if current-input-method
                            (propertize "FR" 'face 'italic)
                          (propertize "EN" 'face 'italic) ) )
                 '(:eval
                     (propertize
                     (format-time-string
                     "  %-d/%-m %H:%M " (current-time) )
                     'face 'shadow) ) 
                 ;;'default-directory
                 '(:eval (propertize (format-mode-line
                                     mode-line-buffer-identification)
                                     'face 'success) )
                 '(:eval (propertize " %l:%c " 'face 'shadow))
                 ) ) 


#+end_src

Il est possible de rajouter bien d'autre option, dont l'indiquation de
la branche du dépôt git. Pour cela ajouter le code suivant à l'endroit
voulu :

#+begin_src emacs-lisp
'(:eval (propertize (replace-regexp-in-string
                    "^ Git:" "" vc-mode )
                    'face 'warning) )
#+end_src

La fonction `mode-line-window-selected-p` permet d'indiquer quel
buffer est actif lorsqu'il y a plusieurs fenêtres ouvertes.

#+begin_src emacs-lisp :tangle "init.el"
  ;; Define a function to only active setting when buffer is active
  (defun mode-line-window-selected-p ()
      (let ((window (selected-window)))
      (or (eq window (old-selected-window))
          (and (minibuffer-window-active-p (minibuffer-window))
                  (with-selected-window (minibuffer-window)
                  (eq window (minibuffer-selected-window)))))))
#+end_src

*** Les packages

Code utilisé précédemment jusqu'au <2024-12-17 Tue>.

#+begin_src emacs-lisp 
  ;; Install MELPA package
  (require 'package)
  (setq package-enable-at-startup nil)
  (add-to-list 'package-archives
               '("melpa" . "https://melpa.org/packages/"))
  (package-initialize)
  (package-refresh-contents)

  ;; PACKAGE NAME: Use-package
  ;; PURPOSE: to easily install package
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
#+end_src

Remplacé le <2024-12-17 Tue> le code d'Andres Gasson ([[https://github.com/frap/emacs-literate][GitHub]]). Cela
améliore indiscutablement la vitesse de chargement d'Emacs à
l'ouverture.

Le premier bloc configure les options de chargement des paquets
Emacs, appelé "[[eww:https://elpa.gnu.org/][Elpa]]", en spécifiant un répertoire personnalisé pour
les paquets, et en assurant l'initialisation du fichier de
configurations des paquets. Il vérifie également également si le
répertoire personnalisé des paquets existe déjà, et le crée s'il
n'existe pas.

#+begin_src emacs-lisp :tangle "init.el"
;; Configuration des options de chargement des paquets Elpa
(eval-and-compile
  (setq load-prefer-newer t
        package-user-dir "~/.emacs.d/elpa"
        package--init-file-ensured t
        package-enable-at-startup nil)

  (unless (file-directory-p package-user-dir)
    (make-directory package-user-dir t)))
#+end_src

En utilisant cette approche, on s'assure que les options de chargement
des paquets Emacs sont correctement configuées dès le début de
l'exécution d'Emacs. Cela permet de personnaliser le répertoire de
stockage des paquets, d'assurer l'initialisation correcte des
configurations des paquets, et de garantir que le répertoire
personnalisé des paquets est crée si nécessaire, ce qui aide à
organiser et gérer efficacement les dépendances des paquets Emacs.

#+begin_src emacs-lisp :tangle "init.el"
(eval-and-compile
  (setq load-path (append load-path (directory-files package-user-dir t "^[^.]" t))))

;;(setq use-package-always-defer t
;;      use-package-verbose t)

(eval-when-compile
  (require 'package)

  (unless (assoc-default "melpa" package-archives)
    (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/") t))
  (unless (assoc-default "org" package-archives)
    (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t))

  (package-initialize)
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  (unless (package-installed-p 'bind-key)
    (package-refresh-contents)
    (package-install 'bind-key))
  (require 'use-package)
  (require 'bind-key)
  (setq use-package-always-ensure t))
#+end_src

*** try - essayer un package sans l'installer

Le package ~try~ permet d'essayer un package sans l'installer. Pour
plus de détail voir le [[https://github.com/larstvei/Try][dépôt GitHub]]. Le package sera enregistré dans
un fichier temporaire.

#+begin_src emacs-lisp :tangle "init.el"
  ;; PACKAGE NAME: try
  ;; PURPOSE: to try package without install them
  (use-package try
    :ensure t)
#+end_src

*** which-key - menu du choix des touches

Which-key permet de visualiser les raccourcis possibles d'une commande
en cours. Ce paquet sera inclue dans la version 30 de emacs.

#+begin_src emacs-lisp :tangle "init.el"
  ;; PACKAGE NAME: whick-key
  ;; PURPOSE: to help to find next key, using a
  ;; menu at the bottom of the window
  (use-package which-key
    :ensure t
    :config (which-key-mode))
#+end_src

*** Le thème
Il existe beaucoup de thèmes et chacun choisit ou modifie le sien
selon ses préférences. Pour l'IEDmacs c'est le thème crée par "Prot"
(voir "Les Oracles"). Il a été choisi pour son confort.

#+begin_src emacs-lisp :tangle "init.el"
  ;; PACKAGE NAME: modus-themes
  ;; PURPOSE: theme by Protesilaos Stavrou
  (use-package modus-themes
    :defer t
    :ensure t)

  ;; Ligth theme
  (load-theme 'modus-operandi-deuteranopia :no-confirm)

  (defun my-modus-themes-toggle ()
    "Toggle between `modus-operandi' and `modus-vivendi' themes.
  This uses `enable-theme' instead of the standard method of
  `load-theme'.  The technicalities are covered in the Modus themes
  manual."
    (interactive)
    (pcase (modus-themes--current-theme)
      ('modus-operandi-deuteranopia (progn (enable-theme 'modus-vivendi-tinted)
                              (disable-theme 'modus-operandi-deuteranopia)))
      ('modus-vivendi-tinted (progn (enable-theme 'modus-operandi-deuteranopia)
                              (disable-theme 'modus-vivendi-tinted)))
      (_ (error "No Modus theme is loaded; evaluate `modus-themes-load-themes' first"))))
#+end_src

*** Ace window

#+begin_src emacs-lisp :tangle "init.el"
  ;; PACKAGE NAME: ace-window
  ;; PURPOSE: select a window more easily
  (global-set-key (kbd "M-o") 'ace-window)
#+end_src

