init.el

(defun wiki-ied-buffer ()
"Creation d'un nouveau buffer qui affiche les liens vers les chapitres du Wiki"
(let ((buffer (get-buffer-create "*WikiIED8*")))
  (with-current-buffer buffer
    (erase-buffer)
    ;; Insérer le contenu du modèle
    (insert (propertize "Sommaire du Wiki\n\n" 'face 'bold))
    (insert "Cliquer sur le lien pour ouvrir la page dans eww (Emacs Web Browser)\n\n")

    ;; Paragraphe - Raccourcis utiles eww
    (insert "Les commandes utiles pour naviguer avec eww:\n\n")

    ;; List des raccourcis
    (insert (propertize "r" 'face 'bold) ": page eww précédente\n")
    (insert (propertize "l" 'face 'bold) ": page eww suivante \n")
    (insert (propertize "H" 'face 'bold) ": historique des pages eww\n\n")

    ;; Paragraphe - Raccourcis utiles emacs
    (insert "Petit rappel des commandes Emacs:\n\n")
    (insert (propertize "Ctrl-f" 'face 'bold) ": avancer le curseur\n")
    (insert (propertize "Ctrl-b" 'face 'bold) ": reculer le curseur\n")
    (insert (propertize "Ctrl-p" 'face 'bold) ": monter le curseur\n")
    (insert (propertize "Ctrl-n" 'face 'bold) ": descendre le curseur\n")
    (insert (propertize "Ctrl-g" 'face 'bold) ": sors moi de cette m****!\n")
    (insert (propertize "Ctrl-x b" 'face 'bold) ": pour basculer d'une fichier ouvert (buffer) à l'autre.\n\n")

    ;; Sommaire
    (insert (propertize "Général" 'face 'bold) "\n\n")
    (insert-text-button "Trucs cools"
                        'action (lambda (_) (eww "https://wiki.paris8-ied.net/fr/general/cool"))
                        'follow-link t)
    (insert "\n")
    (insert-text-button "Installation sur ce serveur Wiki"
                        'action (lambda (_) (eww "https://wiki.paris8-ied.net/fr/general/installation"))
                        'follow-link t)
    (insert "\n\n")
    (insert (propertize "Informations" 'face 'bold) "\n\n")
    (insert-text-button "Licence 1"
                        'action (lambda (_) (eww "https://wiki.paris8-ied.net/fr/L1"))
                        'follow-link t)
    (insert "\n")
    (insert-text-button "Licence 2"
                        'action (lambda (_) (eww "https://wiki.paris8-ied.net/fr/L2"))
                        'follow-link t)
    (insert "\n")
    (insert-text-button "Licence 3"
                        'action (lambda (_) (eww "https://wiki.paris8-ied.net/fr/L3"))
                        'follow-link t)


      ;; Configurer le buffer en mode read-only
      (setq buffer-read-only t))

    ;; Basculer vers le nouveau modèle
    (switch-to-buffer buffer)))

(display-time-mode 1)
(setq display-time-day-and-date t)
(setq column-number-mode t)
(setq column-line-mode t)

(setq-default mode-line-format
              (list
               '(:eval (propertize
                        (if (and (boundp 'evil-state)
                              (eq evil-state 'normal) )
                          " V " ;; VIM
                          (if (and (boundp 'evil-state)
                                  (eq evil-state 'insert) )
                          " I " ;; Insert
                          " E ") ) ;; Emacs
                      'face 'cursor) )
               '(:eval (if current-input-method
                          (propertize "FR" 'face 'italic)
                        (propertize "EN" 'face 'italic) ) )
               '(:eval
                   (propertize
                   (format-time-string
                   "  %-d/%-m %H:%M " (current-time) )
                   'face 'shadow) ) 
               ;;'default-directory
               '(:eval (propertize (format-mode-line
                                   mode-line-buffer-identification)
                                   'face 'success) )
               '(:eval (propertize " %l:%c " 'face 'shadow))
               ) )

;; Define a function to only active setting when buffer is active
(defun mode-line-window-selected-p ()
    (let ((window (selected-window)))
    (or (eq window (old-selected-window))
        (and (minibuffer-window-active-p (minibuffer-window))
                (with-selected-window (minibuffer-window)
                (eq window (minibuffer-selected-window)))))))

;; Install MELPA package
(require 'package)
(setq package-enable-at-startup nil)
(add-to-list 'package-archives
             '("melpa" . "https://melpa.org/packages/"))
(package-initialize)
(package-refresh-contents)

;; PACKAGE NAME: Use-package
;; PURPOSE: to easily install package
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

;; PACKAGE NAME: try
;; PURPOSE: to try package without install them
(use-package try
  :defer t
  :ensure t)

;; PACKAGE NAME: whick-key
;; PURPOSE: to help to find next key, using a
;; menu at the bottom of the window
(use-package which-key
  :ensure t
  :config (which-key-mode))

;; PACKAGE NAME: modus-themes
;; PURPOSE: theme by Protesilaos Stavrou
(use-package modus-themes
  :defer t
  :ensure t)

;; Ligth theme
(load-theme 'modus-operandi-deuteranopia :no-confirm)

(defun my-modus-themes-toggle ()
  "Toggle between `modus-operandi' and `modus-vivendi' themes.
This uses `enable-theme' instead of the standard method of
`load-theme'.  The technicalities are covered in the Modus themes
manual."
  (interactive)
  (pcase (modus-themes--current-theme)
    ('modus-operandi-deuteranopia (progn (enable-theme 'modus-vivendi-tinted)
                            (disable-theme 'modus-operandi-deuteranopia)))
    ('modus-vivendi-tinted (progn (enable-theme 'modus-operandi-deuteranopia)
                            (disable-theme 'modus-vivendi-tinted)))
    (_ (error "No Modus theme is loaded; evaluate `modus-themes-load-themes' first"))))

;; PACKAGE NAME: ace-window
;; PURPOSE: select a window more easily
(global-set-key (kbd "M-o") 'ace-window)
