iedmacs.org
*** Swiper - Prévisualisation de la recherche

Swiper facilite la recherche dans un document. Swiper utilise deux
packages appelés ~Ivy~ et ~Counsel~ qui permettent une saisie
"générique", c'est-à-dire que quelques lettres permettent de trouver
l'équivalent dans le texte ou un liste de fichier.

Pour plus d'information, consulter le dépôt [[https://github.com/abo-abo/swiper/tree/8133016ab1b37da233e6daaab471e40abf0f7ba9][GitHub]].

#+begin_src emacs-lisp :tangle "init.el"
  ;; PACKAGE NAME: swiper
  ;; PURPOSE: facilitate search in a document
  (use-package counsel
    :ensure t
    )

  (use-package swiper
    :ensure t
    :config
    (progn
      (ivy-mode)
      (setq ivy-use-virtual-buffers t)
      (setq enable-recursive-minibuffers t)
      ;; enable this if you want `swiper' to use it
      ;; (setq search-default-mode #'char-fold-to-regexp)
      (global-set-key "\C-s" 'swiper)
      (global-set-key (kbd "C-c C-r") 'ivy-resume)
      (global-set-key (kbd "<f6>") 'ivy-resume)
      (global-set-key (kbd "M-x") 'counsel-M-x)
      (global-set-key (kbd "C-x C-f") 'counsel-find-file)
      (global-set-key (kbd "<f1> f") 'counsel-describe-function)
      (global-set-key (kbd "<f1> v") 'counsel-describe-variable)
      (global-set-key (kbd "<f1> o") 'counsel-describe-symbol)
      (global-set-key (kbd "<f1> l") 'counsel-find-library)
      (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
      (global-set-key (kbd "<f2> u") 'counsel-unicode-char)
      (global-set-key (kbd "C-c g") 'counsel-git)
      (global-set-key (kbd "C-c j") 'counsel-git-grep)
      (global-set-key (kbd "C-c k") 'counsel-ag)
      (global-set-key (kbd "C-x l") 'counsel-locate)
      (global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
      (define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history)
      ))
#+end_src

*** Evil Mode

#+begin_src emacs-lisp :tangle "init.el"
  ;; ====== EVIL MODE SETTINGS ========
  ;; PACKAGE: evil
  ;; PURPOSE: using Vim shortcuts in emacs 
  (use-package evil
    :ensure t
    :init(setq evil-want-C-i-jump nil))

  (setq evil-default-state 'normal)
  (require 'evil)
  (evil-mode 0)

  ;; Biding keys
  ;; to change evil to emacs C-z
  (evil-set-leader 'normal (kbd "SPC"))
  (evil-define-key 'normal 'global (kbd "<leader>bs") 'save-buffer)
  (evil-define-key 'normal 'global (kbd "<leader>bb") 'switch-to-buffer)
  (evil-define-key 'normal 'global (kbd "<leader>ff") 'find-file)
  (evil-define-key 'normal 'global (kbd "<leader>ts") 'modus-themes-select) 
  (evil-define-key 'normal 'global (kbd "<leader>tt") 'my-modus-themes-toggle) 
  (evil-define-key 'normal 'global (kbd "<leader>1") 'delete-other-windows) 
  (evil-define-key 'normal 'global (kbd "<leader>ws") 'ace-select-window) 
  (evil-define-key 'normal 'global (kbd "<leader>wd") 'ace-delete-window) 
  (evil-define-key 'normal 'global (kbd "<leader>w1") 'ace-delete-other-windows) 
  (evil-define-key 'normal 'global (kbd "<leader>bk") 'save-buffers-kill-terminal)
  (evil-define-key 'normal 'global (kbd "<leader>w-") 'split-window-below) 
  (evil-define-key 'normal 'global (kbd "<leader>w/") 'split-window-right) 
  (evil-define-key 'normal 'global (kbd "<leader>bn") 'next-buffer) 
  (evil-define-key 'normal 'global (kbd "<leader>bp") 'previous-buffer)
  (evil-define-key 'normal 'global (kbd "<leader>fc") 'counsel-find-file)
  (evil-define-key 'normal 'global (kbd "<leader>bl") 'list-buffers)
  (evil-define-key 'normal 'global (kbd "<leader>tl") 'load-themes)
  (evil-define-key 'normal 'global (kbd "<leader>ss") 'swiper)
  (evil-define-key 'normal 'global (kbd "<leader>l") 'org-insert-link)
#+end_src

*** pdf-tools
Paquet permettant de visualiser et modifier les fichiers PDF. Utiliser
également lors de l'export avec la commande ~C-v C-e l o~ dont le "o"
final signifie "open", et qui ouvre le PDF fraîchement créé. Pour plus
d'information sur son utilisation voir le manuel utilisateur.

#+begin_src emacs-lisp :tangle "init.el"
  (use-package pdf-tools
    :ensure t
    :config
    (pdf-tools-install) )
#+end_src

*** ido

#+begin_src emacs-lisp :tangle "init.el"
  ;; ido to easy find the names of files, docs, when searching
  ;;(setq indo-enable-flex-matching t) ;; unavailable
  (setq ido-everywhere t)
  (ido-mode 1)
#+end_src

*** alias

#+begin_src emacs-lisp :tangle "init.el"
  ;; better visualization of buffer-list
  (defalias 'list-buffers 'ibuffer)
  ;;(defalias 'list-buffers 'ibuffer-other-window)

  ;; to set up the directory file, when opening new file
  (setq default-directory "~/")

  ;; to display line number
  ;; (global-display-line-numbers-mode)
#+end_src

*** gptel

Ajouter des LLM comme Chatgpt ou Gemini à Emacs à quelque chose d'un
peu obscène, dans le sens où la philosophie d'Emacs est d'être 100%
libre, et que ces modèles et les sociétés qui les exploitent sont à
l'opposé de cette philosophie, je pense, même si au moins l'une
d'entre elle en tous les cas, se repose largement sur les logiciels
libres pour son développement, mais en profite pour collecter et
utiliser massivement nos données, ce pourquoi [[eww:https://en.wikipedia.org/wiki/Richard_Stallman][Richard Stallman]], l'un
des auteurs de GNU Emacs se bat avec ferveur depuis de nombreuses
années.

Pour ce donner un brin de bonne conscience et d'éthique qui ne
laissera personne vraiment dupe, l'activation de ce paquet ne sera
donc pas automatique, et vous devrez l'activer vous même en toute
connaissance de cause, concernant la collecte et l'utilisation de vos
données, ainsi que de l'empreinte carbone désastreuse de ces modèles.

#+begin_src emacs-lisp
 #+begin_src emacs-lisp :tangle "~/.emacs.d/init.el"
  (use-package gptel
    :ensure t
    :config
    (load "/home/aretaro/.emacs.d/idemacs-modules/idemacs-gptel.el") )

  ;; required to display gptel-menu
  (setq package-install-upgrade-built-in t)
  (progn (unload-feature 'seq t) (require 'seq))
#+end_src


Pour le bloc suivant il est recommander de créer un module particulier
pour vos clés API, afin d'éviter de les partager si vous souhaitez
mettre votre fichier ~init.el~ sur GitHub par exemple.

Pour enchevêtrer le bloc ci-dessous, utilser un lien du type :
~:tangle "~/.emacs.d/iedmacs-modules/iedmacs-gptel.el" :mkdirp yes~ à
placer après ~#+begin_src emacs-lisp~ sur la même ligne.

#+begin_src emacs-lisp 
(setq gptel-api-key "<API_KEY>")
(gptel-make-gemini "Gemini" :key "<API_KEY>" :stream t)
#+end_src

Pour plus d'information, voir le dépôt [[https://github.com/karthink/gptel?tab=readme-ov-file#usage][GitHub]].

*** Org-mode

#+begin_src emacs-lisp :tangle "init.el"
  ;; Org mode stuff
  (use-package org-bullets
    :defer t
    :ensure t
    :config
    (add-hook 'org-mode-hook 'org-bullets-mode))

  ;; for converting org to pdf
  ;; defined org-plain-latex used in latex-standard.org
  (with-eval-after-load 'ox-latex
    (add-to-list 'org-latex-classes
                 '("org-plain-latex"
                   "\\documentclass{article}
             [NO-DEFAULT-PACKAGES]
             [PACKAGES]
             [EXTRA]"
                   ("\\section{%s}" . "\\section*{%s}")
                   ("\\subsection{%s}" . "\\subsection*{%s}")
                   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                   ("\\paragraph{%s}" . "\\paragraph*{%s}")
                   ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
#+end_src

** A faire

* Recommandations
* Sources
